In [1]:
import pandas as pd
import numpy as np

## Getting started

In [3472]:
my_dataset = {
  'students': ["John", "Mary", "Kiril"],
  'grades': [88, 70, 99],
  'scores': ('B+', 'C-', 'A+'),
}

my_df = pd.DataFrame(my_dataset)
print(my_df)

  students  grades scores
0     John      88     B+
1     Mary      70     C-
2    Kiril      99     A+

# Series

A Series is a column-vector. It is an array of individual entries, each of which has a certain value.

In [3473]:
ages = pd.Series([18, 35, 42], name="Age")
ages

0    18
1    35
2    42
Name: Age, dtype: int64

In [3474]:
ages[1:2]
ages.iloc[1:2]
# ages.loc[1:2]

1    35
Name: Age, dtype: int64

In [3475]:
array = [1, 5, 'hello', 4, -10]
col_vec = pd.Series(array, name="Something")
col_vec

0        1
1        5
2    hello
3        4
4      -10
Name: Something, dtype: object

In [3476]:
col_vec[1:4]

1        5
2    hello
3        4
Name: Something, dtype: object

In [3477]:
array = [1, 5, 'hello', 4, -10]
col_vec = pd.Series(array, 
                    index=['a','b','c','d','e'])
col_vec

a        1
b        5
c    hello
d        4
e      -10
dtype: object

In [3478]:
col_vec['c']
col_vec['b'::2]
col_vec.iloc[1:]
col_vec.loc[['c','a']]
col_vec.loc['c':]

c    hello
d        4
e      -10
dtype: object

In [3479]:
grades = {"John": 88, "Mary": 70, "Kiril": 99}
my_ser = pd.Series(grades, name='Grades')
my_ser

John     88
Mary     70
Kiril    99
Name: Grades, dtype: int64

In [3480]:
grades = {"John": 88, "Mary": 70, "Kiril": 99}
my_ser = pd.Series(grades, name="Grades")

In [3481]:
df = pd.DataFrame(my_ser)
df

       Grades
John       88
Mary       70
Kiril      99

In [3482]:
my_ser = pd.Series(grades, index = ["John", "Mary"])
my_ser

John    88
Mary    70
dtype: int64

In [3483]:
grades = {"John": 88, "Mary": 70, "Kiril": 99, "Nadia": 90}
other_ser = pd.Series(grades)

In [3484]:
my_ser + other_ser

John     176.0
Kiril      NaN
Mary     140.0
Nadia      NaN
dtype: float64

In [3485]:
series1 = pd.Series([1, 2, 3])
series2 = pd.Series([4, 5, 6])

series1 + series2

0    5
1    7
2    9
dtype: int64

# Dataframes

A DataFrame is a table. It contains an array of individual entries, each of which has a certain value. Each entry corresponds to a row (or record) and a column.

### Toy example 1: DataFrame from a dictionary

In [3486]:
data = {
    'Date': ['2025-01-10', '2025-01-12', '2025-01-13', '2025-01-02', '2025-01-02', '2025-01-03', '2024-05-03', '2024-05-03'],
    'Item': ('Apple', 'Banana', 'Orange', 'Apple', 'Banana', 'Orange', 'Apple', 'Orange'),
    'Units Sold': [30, 21, 15, 40, 34, 20, 45, 25],
    'Price Per Unit': [1.0, 0.5, 0.75, 1.0, 0.5, 0.75, 1.0, 0.75],
    'Salesperson': ['John', 'John', 'John', 'Alice', 'Alice', 'John', 'Alice', 'John']
}

df = pd.DataFrame(data)

# Display the DataFrame
df

         Date    Item  Units Sold  Price Per Unit Salesperson
0  2025-01-10   Apple          30            1.00        John
1  2025-01-12  Banana          21            0.50        John
2  2025-01-13  Orange          15            0.75        John
3  2025-01-02   Apple          40            1.00       Alice
4  2025-01-02  Banana          34            0.50       Alice
5  2025-01-03  Orange          20            0.75        John
6  2024-05-03   Apple          45            1.00       Alice
7  2024-05-03  Orange          25            0.75        John

### Toy example 2: DataFrame from a matrix

In [3487]:
toy_matrix = [[1,2,3,4],
              [4,5,6,7],
              [7,8,9,0],
              [1,1,2,5],
              [0,0,9,6],
              [0,0,10,3]
             ]

df2 = pd.DataFrame(toy_matrix)
df2 = pd.DataFrame(toy_matrix, columns=["A", "B", "C", "D"],index=["a","b","c","d","e","f"],dtype=int)

In [3488]:
# display(df2)
# print(df2)
df2

   A  B   C  D
a  1  2   3  4
b  4  5   6  7
c  7  8   9  0
d  1  1   2  5
e  0  0   9  6
f  0  0  10  3

### Summary of the basic information about the DataFrame

In [3489]:
df2.shape

(6, 4)

In [3490]:
df2.size

24

In [3491]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, a to f
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      int64
 1   B       6 non-null      int64
 2   C       6 non-null      int64
 3   D       6 non-null      int64
dtypes: int64(4)
memory usage: 240.0+ bytes

In [3492]:
df

         Date    Item  Units Sold  Price Per Unit Salesperson
0  2025-01-10   Apple          30            1.00        John
1  2025-01-12  Banana          21            0.50        John
2  2025-01-13  Orange          15            0.75        John
3  2025-01-02   Apple          40            1.00       Alice
4  2025-01-02  Banana          34            0.50       Alice
5  2025-01-03  Orange          20            0.75        John
6  2024-05-03   Apple          45            1.00       Alice
7  2024-05-03  Orange          25            0.75        John

In [3493]:
df.describe().round(2)
# x% percentile is the value below which x% of the data points fall
# df.select_dtypes(include=['number']).describe().round(2)

       Units Sold  Price Per Unit
count        8.00            8.00
mean        28.75            0.78
std         10.42            0.21
min         15.00            0.50
25%         20.75            0.69
50%         27.50            0.75
75%         35.50            1.00
max         45.00            1.00

In [3494]:
df.select_dtypes(include=['category', 'object']).describe()

              Date   Item Salesperson
count            8      8           8
unique           6      3           2
top     2024-05-03  Apple        John
freq             2      3           5

In [3495]:
df

         Date    Item  Units Sold  Price Per Unit Salesperson
0  2025-01-10   Apple          30            1.00        John
1  2025-01-12  Banana          21            0.50        John
2  2025-01-13  Orange          15            0.75        John
3  2025-01-02   Apple          40            1.00       Alice
4  2025-01-02  Banana          34            0.50       Alice
5  2025-01-03  Orange          20            0.75        John
6  2024-05-03   Apple          45            1.00       Alice
7  2024-05-03  Orange          25            0.75        John

In [3496]:
df.nunique()
# Return the number of unique values in each column of a DataFrame

Date              6
Item              3
Units Sold        8
Price Per Unit    3
Salesperson       2
dtype: int64

### Head, Tail, and Sample

In [3497]:
df.head(3)

         Date    Item  Units Sold  Price Per Unit Salesperson
0  2025-01-10   Apple          30            1.00        John
1  2025-01-12  Banana          21            0.50        John
2  2025-01-13  Orange          15            0.75        John

In [3498]:
df.tail(3)

         Date    Item  Units Sold  Price Per Unit Salesperson
5  2025-01-03  Orange          20            0.75        John
6  2024-05-03   Apple          45            1.00       Alice
7  2024-05-03  Orange          25            0.75        John

In [3499]:
df.sample(5)

         Date    Item  Units Sold  Price Per Unit Salesperson
5  2025-01-03  Orange          20            0.75        John
4  2025-01-02  Banana          34            0.50       Alice
7  2024-05-03  Orange          25            0.75        John
2  2025-01-13  Orange          15            0.75        John
6  2024-05-03   Apple          45            1.00       Alice

### Getting indices (names) of columns

In [3500]:
df.columns

Index(['Date', 'Item', 'Units Sold', 'Price Per Unit', 'Salesperson'], dtype='object')

### Getting indices of rows

In [3501]:
# df.rows does NOT exist
# use df.index instead
df.index

RangeIndex(start=0, stop=8, step=1)

## Accessing rows, columns and elements of a DataFrame

In [3502]:
df = df2

### Columns

- You can directly access columns using
    - Its name
    - Or a list/array of names
- You CANNOT use a range!

In [3503]:
df[["A","A","C"]]

   A  A   C
a  1  1   3
b  4  4   6
c  7  7   9
d  1  1   2
e  0  0   9
f  0  0  10

In [3504]:
df[df.columns[1:3]]

   B   C
a  2   3
b  5   6
c  8   9
d  1   2
e  0   9
f  0  10

### Rows 

- You can directly access rows only **using a range**

In [3505]:
df['b':'c']
# but you cannot access a row / rows doing df['a'] or df[['a']] or df[['a','b']]

   A  B  C  D
b  4  5  6  7
c  7  8  9  0

### Rows and Columns

In [3506]:
df[["D","A"]]['b'::2]

   D  A
b  7  4
d  5  1
f  3  0

In [3507]:
df['b'::2]["A"]

b    4
d    1
f    0
Name: A, dtype: int64

In [3508]:
df[1:]['b'::2]

   A  B   C  D
b  4  5   6  7
d  1  1   2  5
f  0  0  10  3

### `loc` & `iloc` 
Usage: `loc[rows]` or `loc[rows, columns]`

Usage: `iloc[rows]` or `iloc[rows, columns]`

In [3509]:
df

   A  B   C  D
a  1  2   3  4
b  4  5   6  7
c  7  8   9  0
d  1  1   2  5
e  0  0   9  6
f  0  0  10  3

### Rows

In [3510]:
# df.loc['b']
# df.iloc[3:]

In [3511]:
df.loc['b':]
df.iloc[1:]

   A  B   C  D
b  4  5   6  7
c  7  8   9  0
d  1  1   2  5
e  0  0   9  6
f  0  0  10  3

In [3512]:
df.loc[['b','a','f']]
# df.iloc[[1,0,5]]

   A  B   C  D
b  4  5   6  7
a  1  2   3  4
f  0  0  10  3

### Columns

In [3513]:
df

   A  B   C  D
a  1  2   3  4
b  4  5   6  7
c  7  8   9  0
d  1  1   2  5
e  0  0   9  6
f  0  0  10  3

In [3514]:
df.loc[:,'B':]
df.iloc[:,[1]]

   B
a  2
b  5
c  8
d  1
e  0
f  0

In [3515]:
df.loc[:,['B','A']]
df.iloc[:,[1,0]]

   B  A
a  2  1
b  5  4
c  8  7
d  1  1
e  0  0
f  0  0

In [3516]:
df.loc[:,'B'::2]
df.iloc[:,1::2]

   B  D
a  2  4
b  5  7
c  8  0
d  1  5
e  0  6
f  0  3

### Row and Columns

In [3517]:
df.loc['b':'e', ["A", "C"]]

   A  C
b  4  6
c  7  9
d  1  2
e  0  9

In [3518]:
df.iloc[3:5, 1:]

   B  C  D
d  1  2  5
e  0  9  6

### Individual Elements

In [3519]:
df

   A  B   C  D
a  1  2   3  4
b  4  5   6  7
c  7  8   9  0
d  1  1   2  5
e  0  0   9  6
f  0  0  10  3

In [3520]:
df.loc['a', 'A']
df.at['a', 'A']

np.int64(1)

In [3521]:
df.iloc[0,0]
df.iat[0,0]

np.int64(1)

### Difference in indexing between loc and iloc

In [3522]:
df_reset = df.reset_index(drop=True)  # drop=True removes the old index
df_reset

   A  B   C  D
0  1  2   3  4
1  4  5   6  7
2  7  8   9  0
3  1  1   2  5
4  0  0   9  6
5  0  0  10  3

In [3523]:
df_reset.loc[2:5]

   A  B   C  D
2  7  8   9  0
3  1  1   2  5
4  0  0   9  6
5  0  0  10  3

## Sorting

In pandas, there are two main ways to sort a DataFrame:


#### `sort_index()`
Sorts by row or column labels.  
Default is along rows (`axis=0`), but you can also sort columns with `axis=1`.

 
`df.sort_index()`  sorts rows by index  
`df.sort_index(axis=1)`  sorts columns by names  



#### `sort_values()`
Sorts by the values in one or more columns.  
Use the `by` parameter to choose the column(s).

 
`df.sort_values(by="A")`  sorts rows by column A  
`df.sort_values(by=["B","C"])`  sorts rows by B, then by C

In [3524]:
df

   A  B   C  D
a  1  2   3  4
b  4  5   6  7
c  7  8   9  0
d  1  1   2  5
e  0  0   9  6
f  0  0  10  3

In [3525]:
df.sort_index(axis=0, ascending=True)

   A  B   C  D
a  1  2   3  4
b  4  5   6  7
c  7  8   9  0
d  1  1   2  5
e  0  0   9  6
f  0  0  10  3

In [3526]:
df.sort_values(by=["A", "B", 'C'], ascending=[True,False, True])

   A  B   C  D
e  0  0   9  6
f  0  0  10  3
a  1  2   3  4
d  1  1   2  5
b  4  5   6  7
c  7  8   9  0

## Adding, Removing, Renaming rows and columns

### Adding Rows
- Use `loc` 

Example:  
`df.loc[5] = ["Alice", 23, "NY"]`  add a new row with index 5

In [3527]:
df.loc['w'] = [1,2,3,4]
df

   A  B   C  D
a  1  2   3  4
b  4  5   6  7
c  7  8   9  0
d  1  1   2  5
e  0  0   9  6
f  0  0  10  3
w  1  2   3  4

### Adding Columns
You can add a new column by broadcasting:
- `df["new_col"] = values` add from a list, Series, or expression.  
Example:  
`df["Total"] = df["Price"] * df["Quantity"]`

Other useful ways:

- Using `np.where()`:  
  `df["HighSales"] = np.where(df["Total"] > 100, "Yes", "No")`  creates a column with conditional values.

- Using `.apply()`:  
  `df["NameLength"] = df["Name"].apply(len)`   applies a function to each element of a column.

- Using `.assign()`:  
  `df.assign(new_col_name=lambda x: x["Total"] * 0.9)`  creates a new DataFrame with the extra column.

In [3528]:
df.loc[:,'price'] = 10
df

   A  B   C  D  price
a  1  2   3  4     10
b  4  5   6  7     10
c  7  8   9  0     10
d  1  1   2  5     10
e  0  0   9  6     10
f  0  0  10  3     10
w  1  2   3  4     10

In [3529]:
df["new"] = df["A"] * df["B"]
df

   A  B   C  D  price  new
a  1  2   3  4     10    2
b  4  5   6  7     10   20
c  7  8   9  0     10   56
d  1  1   2  5     10    1
e  0  0   9  6     10    0
f  0  0  10  3     10    0
w  1  2   3  4     10    2

#### Adding with `np.where()`

In [3530]:
df['new_price'] = np.where(df['A'] >= 2, 5, 3) 
df

   A  B   C  D  price  new  new_price
a  1  2   3  4     10    2          3
b  4  5   6  7     10   20          5
c  7  8   9  0     10   56          5
d  1  1   2  5     10    1          3
e  0  0   9  6     10    0          3
f  0  0  10  3     10    0          3
w  1  2   3  4     10    2          3

#### Adding with `.apply()`

In [3531]:
df['some_category'] = df['D'].apply(lambda x: 'Short' if x < 4 else ('Average' if x < 5 else 'Tall'))
df

   A  B   C  D  price  new  new_price some_category
a  1  2   3  4     10    2          3       Average
b  4  5   6  7     10   20          5          Tall
c  7  8   9  0     10   56          5         Short
d  1  1   2  5     10    1          3          Tall
e  0  0   9  6     10    0          3          Tall
f  0  0  10  3     10    0          3         Short
w  1  2   3  4     10    2          3       Average

In [3532]:
def categorize(row):
    if row['C'] < 3 and row['D'] < 5:
        return 'Light'
    elif row['C'] < 5 or row['D'] <= 6:
        return 'Middle'
    else:
        return 'Heavy'
    
df['one more category'] = df.apply(categorize, axis=1)
df

   A  B   C  D  price  new  new_price some_category one more category
a  1  2   3  4     10    2          3       Average            Middle
b  4  5   6  7     10   20          5          Tall             Heavy
c  7  8   9  0     10   56          5         Short            Middle
d  1  1   2  5     10    1          3          Tall            Middle
e  0  0   9  6     10    0          3          Tall            Middle
f  0  0  10  3     10    0          3         Short            Middle
w  1  2   3  4     10    2          3       Average            Middle

In [3533]:
def random_name(_):
    first_names = ['Alice', 'Bob', 'Charlie', 'David', 'Emma', 'Frank', 'Grace', 'Helen']
    last_names = ['Smith', 'Johnson', 'Williams', 'Brown', 'Jones', 'Miller', 'Davis', 'Garcia']
    return f"{np.random.choice(first_names)} {np.random.choice(last_names)}"

df['Name'] = df.apply(random_name, axis=1)

df

,A,B,C,D,price,new,new_price,some_category,one more category,Name
a,1,2,3,4,10,2,3,Average,Middle,Helen Davis
b,4,5,6,7,10,20,5,Tall,Heavy,Grace Brown
c,7,8,9,0,10,56,5,Short,Middle,Alice Johnson
d,1,1,2,5,10,1,3,Tall,Middle,David Miller
e,0,0,9,6,10,0,3,Tall,Middle,Bob Davis
f,0,0,10,3,10,0,3,Short,Middle,Grace Brown
w,1,2,3,4,10,2,3,Average,Middle,Alice Garcia

In [3534]:
df['First Name'] = df['Name'].str.split().str[0]
df

,A,B,C,D,price,new,new_price,some_category,one more category,Name,First Name
a,1,2,3,4,10,2,3,Average,Middle,Helen Davis,Helen
b,4,5,6,7,10,20,5,Tall,Heavy,Grace Brown,Grace
c,7,8,9,0,10,56,5,Short,Middle,Alice Johnson,Alice
d,1,1,2,5,10,1,3,Tall,Middle,David Miller,David
e,0,0,9,6,10,0,3,Tall,Middle,Bob Davis,Bob
f,0,0,10,3,10,0,3,Short,Middle,Grace Brown,Grace
w,1,2,3,4,10,2,3,Average,Middle,Alice Garcia,Alice

In [3535]:
df.assign(discounted=lambda x: x["price"] * 0.9)
df.assign(discounted=df['price'] * 0.9)

,A,B,C,D,price,new,new_price,some_category,one more category,Name,First Name,discounted
a,1,2,3,4,10,2,3,Average,Middle,Helen Davis,Helen,9.0
b,4,5,6,7,10,20,5,Tall,Heavy,Grace Brown,Grace,9.0
c,7,8,9,0,10,56,5,Short,Middle,Alice Johnson,Alice,9.0
d,1,1,2,5,10,1,3,Tall,Middle,David Miller,David,9.0
e,0,0,9,6,10,0,3,Tall,Middle,Bob Davis,Bob,9.0
f,0,0,10,3,10,0,3,Short,Middle,Grace Brown,Grace,9.0
w,1,2,3,4,10,2,3,Average,Middle,Alice Garcia,Alice,9.0

In [3536]:
df.assign(total=lambda x: x["price"] * x["new"]).assign(disc=lambda x: x["total"] * 0.75)

,A,B,C,D,price,new,new_price,some_category,one more category,Name,First Name,total,disc
a,1,2,3,4,10,2,3,Average,Middle,Helen Davis,Helen,20,15.0
b,4,5,6,7,10,20,5,Tall,Heavy,Grace Brown,Grace,200,150.0
c,7,8,9,0,10,56,5,Short,Middle,Alice Johnson,Alice,560,420.0
d,1,1,2,5,10,1,3,Tall,Middle,David Miller,David,10,7.5
e,0,0,9,6,10,0,3,Tall,Middle,Bob Davis,Bob,0,0.0
f,0,0,10,3,10,0,3,Short,Middle,Grace Brown,Grace,0,0.0
w,1,2,3,4,10,2,3,Average,Middle,Alice Garcia,Alice,20,15.0

In [3537]:
df.assign(**{"total sum": lambda x: x["price"] * x["new"]})

,A,B,C,D,price,new,new_price,some_category,one more category,Name,First Name,total sum
a,1,2,3,4,10,2,3,Average,Middle,Helen Davis,Helen,20
b,4,5,6,7,10,20,5,Tall,Heavy,Grace Brown,Grace,200
c,7,8,9,0,10,56,5,Short,Middle,Alice Johnson,Alice,560
d,1,1,2,5,10,1,3,Tall,Middle,David Miller,David,10
e,0,0,9,6,10,0,3,Tall,Middle,Bob Davis,Bob,0
f,0,0,10,3,10,0,3,Short,Middle,Grace Brown,Grace,0
w,1,2,3,4,10,2,3,Average,Middle,Alice Garcia,Alice,20

## Joining two data frames

- Use `concat()` when you want to stack DataFrames together (row-wise or column-wise), without needing a key match.  
- Use `join()` when you mostly join by index (and want simpler syntax).
- Use `merge()` when you join on columns (like SQL joins).

#### `concat()`  combines DataFrames by stacking along an axis

- **Row-wise concatenation (default, `axis=0`):** stack DataFrames on top of each other.  
- **Column-wise concatenation (`axis=1`):** place DataFrames side by side.  

- **Outer join (default):** keep all labels from both objects.  
- **Inner join:** keep only labels present in both (use `join="inner"`).  

- Use `ignore_index=True` to reset the index in the result.  
- Unlike `join()` or `merge()`, `concat()` does not require matching keys. It just aligns on index/columns and fills gaps with `NaN`.

In [3538]:
df1 = pd.DataFrame({"id": [1, 2, 3], "A": [1, 2, 9], "B": [10, 20, 90]}, index=["a", "b", "c"])
df2 = pd.DataFrame({"id": [1, 3, 5], "A2": [3, 4, -1], "B2": [10, 40, 0]}, index=["b", "c", "d"])

# Row-wise concatenation
pd.concat([df1, df2])

   id    A     B   A2    B2
a   1  1.0  10.0  NaN   NaN
b   2  2.0  20.0  NaN   NaN
c   3  9.0  90.0  NaN   NaN
b   1  NaN   NaN  3.0  10.0
c   3  NaN   NaN  4.0  40.0
d   5  NaN   NaN -1.0   0.0

In [3539]:
# Column-wise concatenation
pd.concat([df1, df2], axis=1)

    id    A     B   id   A2    B2
a  1.0  1.0  10.0  NaN  NaN   NaN
b  2.0  2.0  20.0  1.0  3.0  10.0
c  3.0  9.0  90.0  3.0  4.0  40.0
d  NaN  NaN   NaN  5.0 -1.0   0.0

In [3540]:
# Inner join
pd.concat([df1, df2], join='inner')

   id
a   1
b   2
c   3
b   1
c   3
d   5

In [3541]:
pd.concat([df1, df2], keys=["df1", "df2"])

       id    A     B   A2    B2
df1 a   1  1.0  10.0  NaN   NaN
    b   2  2.0  20.0  NaN   NaN
    c   3  9.0  90.0  NaN   NaN
df2 b   1  NaN   NaN  3.0  10.0
    c   3  NaN   NaN  4.0  40.0
    d   5  NaN   NaN -1.0   0.0

#### `join()`  joins on **index** by default

- **Left join (default):** keep all indices from the left DataFrame.  
- **Right join:** keep all indices from the right DataFrame.  
- **Inner join:** keep only the indices present in both DataFrames.  
- **Outer join:** keep all indices from both DataFrames.  

- By default, joins are done on the **index**.  
- You can also join on a column by setting the other DataFrame's index.  

- If columns have the same name in both DataFrames, use `lsuffix` and `rsuffix` to distinguish them.

In [3542]:
df1 = pd.DataFrame({"id": [1, 2, 3], "A": [1, 2, 9], "B": [10, 20, 90]}, index=["a", "b", "c"])
df2 = pd.DataFrame({"id2": [1, 3, 5], "A2": [3, 4, -1], "B2": [10, 40, 0]}, index=["b", "c", "d"])

df1.join(df2)

   id  A   B  id2   A2    B2
a   1  1  10  NaN  NaN   NaN
b   2  2  20  1.0  3.0  10.0
c   3  9  90  3.0  4.0  40.0

In [3543]:
students = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie"],
    "Major": ["CS", "Math", "DS"]
}, index=["s1", "s2", "s3"])

scores = pd.DataFrame({
    "Course": ["Fundamentals of Data Science", "Data Mining", "Machine Learning"],
    "Score": [85, 92, 78]
}, index=["s1", "s2", "s4"]) 

display(students, scores)

       Name Major
s1    Alice    CS
s2      Bob  Math
s3  Charlie    DS

                          Course  Score
s1  Fundamentals of Data Science     85
s2                   Data Mining     92
s4              Machine Learning     78

In [3544]:
# Default join (left join): keep all indices from the left DataFrame
students.join(scores)

       Name Major                        Course  Score
s1    Alice    CS  Fundamentals of Data Science   85.0
s2      Bob  Math                   Data Mining   92.0
s3  Charlie    DS                           NaN    NaN

In [3545]:
# Right join: keep all indices from the right DataFrame
students.join(scores, how='right')

     Name Major                        Course  Score
s1  Alice    CS  Fundamentals of Data Science     85
s2    Bob  Math                   Data Mining     92
s4    NaN   NaN              Machine Learning     78

In [3546]:
# Inner join: join on intersection of indices
students.join(scores, how="inner")

     Name Major                        Course  Score
s1  Alice    CS  Fundamentals of Data Science     85
s2    Bob  Math                   Data Mining     92

In [3547]:
# Outer join: join on union of indices
students.join(scores, how="outer")

       Name Major                        Course  Score
s1    Alice    CS  Fundamentals of Data Science   85.0
s2      Bob  Math                   Data Mining   92.0
s3  Charlie    DS                           NaN    NaN
s4      NaN   NaN              Machine Learning   78.0

In [3548]:
# Joining on a specific column instead of the index
students.join(scores, on="Major")

       Name Major Course  Score
s1    Alice    CS    NaN    NaN
s2      Bob  Math    NaN    NaN
s3  Charlie    DS    NaN    NaN

In [3549]:
students = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie"],
    "Major": ["CS", "Math", "DS"]
}, index=["s1", "s2", "s3"])

scores = pd.DataFrame({
    "Course": ["Fundamentals of Data Science", "Data Mining", "Machine Learning"],
    "Score": [85, 92, 78],
    "Major": ["CS", "Math", "Biology"]
}, index=["s1", "s2", "s4"]) 

display(students, scores)

       Name Major
s1    Alice    CS
s2      Bob  Math
s3  Charlie    DS

                          Course  Score    Major
s1  Fundamentals of Data Science     85       CS
s2                   Data Mining     92     Math
s4              Machine Learning     78  Biology

In [3550]:
students.join(scores, lsuffix="_student", rsuffix="_dept")

       Name Major_student                        Course  Score Major_dept
s1    Alice            CS  Fundamentals of Data Science   85.0         CS
s2      Bob          Math                   Data Mining   92.0       Math
s3  Charlie            DS                           NaN    NaN        NaN

#### `merge()`  joins on **common column names** by default

- **Inner merge (default):** keep only the rows where keys (= values of columns with the same names) match in both DataFrames.  
- **Outer merge:** for each row:
    - if keys (= values of columns with the same names) match in both DataFrames, merges rows
    - if keys don't match, adds necessary NaNs to each of rows, adds both rows  
- **Left merge:** keep all rows from the left DataFrame, matching with the right where possible.  
- **Right merge:** keep all rows from the right DataFrame, matching with the left where possible.  

- Joins are performed on one or more **columns (keys)**.  
- You can also merge on the *index* using `left_index=True` and `right_index=True`.  

- If non-key columns have the *same name* in both DataFrames, pandas adds suffixes (`_x`, `_y` by default).  
  You can set custom suffixes with the `suffixes` parameter.

In [3551]:
df1 = pd.DataFrame({"id": [1, 3, 3], "A": [3, 2, 9], "B": [10, 20, 90]})
df2 = pd.DataFrame({"id": [1, 3, 5], "A": [3, 4, -1], "B2": [10, 40, 0]})
display(df1, df2)

   id  A   B
0   1  3  10
1   3  2  20
2   3  9  90

   id  A  B2
0   1  3  10
1   3  4  40
2   5 -1   0

In [3552]:
# Inner merge (default): keep only the rows where keys (= values of columns with the same names) match in both DataFrames.

df1.merge(df2)

   id  A   B  B2
0   1  3  10  10

In [3553]:
# Outer merge: for each row:
#   if keys (= values of columns with the same names) match in both DataFrames, merges rows
#   if keys don't match, adds necessary NaNs to each of rows, adds both rows
df1.merge(df2, how='outer')

   id  A     B    B2
0   1  3  10.0  10.0
1   3  2  20.0   NaN
2   3  4   NaN  40.0
3   3  9  90.0   NaN
4   5 -1   NaN   0.0

In [3554]:
# Left merge: keep all rows from the left DataFrame, matching with the right where possible.  
df1.merge(df2, how='left')

   id  A   B    B2
0   1  3  10  10.0
1   3  2  20   NaN
2   3  9  90   NaN

In [3555]:
# Right merge: keep all rows from the right DataFrame, matching with the right where possible.  
df1.merge(df2, how='right')

   id  A     B  B2
0   1  3  10.0  10
1   3  4   NaN  40
2   5 -1   NaN   0

In [3556]:
df1.merge(df2, left_index=True, right_index=True, suffixes=("_1", "_2"))
# df1.merge(df2, left_index=True, right_on='A')

   id_1  A_1   B  id_2  A_2  B2
0     1    3  10     1    3  10
1     3    2  20     3    4  40
2     3    9  90     5   -1   0

### Removing Rows
- `df.drop(index, axis=0)`  remove by index.  

Example: `df.drop(2)` removes row with index 2.

In [3557]:
df.drop(index=['v'], inplace=True, errors='ignore')  
# df = df.drop(index=['v'], errors='ignore')
df

,A,B,C,D,price,new,new_price,some_category,one more category,Name,First Name
a,1,2,3,4,10,2,3,Average,Middle,Helen Davis,Helen
b,4,5,6,7,10,20,5,Tall,Heavy,Grace Brown,Grace
c,7,8,9,0,10,56,5,Short,Middle,Alice Johnson,Alice
d,1,1,2,5,10,1,3,Tall,Middle,David Miller,David
e,0,0,9,6,10,0,3,Tall,Middle,Bob Davis,Bob
f,0,0,10,3,10,0,3,Short,Middle,Grace Brown,Grace
w,1,2,3,4,10,2,3,Average,Middle,Alice Garcia,Alice

### Removing Columns
- `df.drop("colname", axis=1, inplace=True)`  remove a column.  
- For multiple: `df.drop(["col1","col2"], axis=1)`

In [3558]:
df.drop(columns=['price'], inplace=True, errors='ignore')
# df = df.drop(columns=['price'], errors='ignore')
df

,A,B,C,D,new,new_price,some_category,one more category,Name,First Name
a,1,2,3,4,2,3,Average,Middle,Helen Davis,Helen
b,4,5,6,7,20,5,Tall,Heavy,Grace Brown,Grace
c,7,8,9,0,56,5,Short,Middle,Alice Johnson,Alice
d,1,1,2,5,1,3,Tall,Middle,David Miller,David
e,0,0,9,6,0,3,Tall,Middle,Bob Davis,Bob
f,0,0,10,3,0,3,Short,Middle,Grace Brown,Grace
w,1,2,3,4,2,3,Average,Middle,Alice Garcia,Alice

In [3559]:
if 'price' in df.columns:
    df.pop('price')
df

,A,B,C,D,new,new_price,some_category,one more category,Name,First Name
a,1,2,3,4,2,3,Average,Middle,Helen Davis,Helen
b,4,5,6,7,20,5,Tall,Heavy,Grace Brown,Grace
c,7,8,9,0,56,5,Short,Middle,Alice Johnson,Alice
d,1,1,2,5,1,3,Tall,Middle,David Miller,David
e,0,0,9,6,0,3,Tall,Middle,Bob Davis,Bob
f,0,0,10,3,0,3,Short,Middle,Grace Brown,Grace
w,1,2,3,4,2,3,Average,Middle,Alice Garcia,Alice

### Renaming Rows
- `df.rename(index={0:"first"})` rename row label 0 to "first".

In [3560]:
df.rename(index={'b': 'x'}, inplace=True)
df

,A,B,C,D,new,new_price,some_category,one more category,Name,First Name
a,1,2,3,4,2,3,Average,Middle,Helen Davis,Helen
x,4,5,6,7,20,5,Tall,Heavy,Grace Brown,Grace
c,7,8,9,0,56,5,Short,Middle,Alice Johnson,Alice
d,1,1,2,5,1,3,Tall,Middle,David Miller,David
e,0,0,9,6,0,3,Tall,Middle,Bob Davis,Bob
f,0,0,10,3,0,3,Short,Middle,Grace Brown,Grace
w,1,2,3,4,2,3,Average,Middle,Alice Garcia,Alice

### Renaming Columns
- `df.rename(columns={"old":"new"}, inplace=True)`  

Example: `df.rename(columns={"A":"Alpha"})`

In [3561]:
df.rename(columns={'new_price': 'price'}, inplace=True)
df

,A,B,C,D,new,price,some_category,one more category,Name,First Name
a,1,2,3,4,2,3,Average,Middle,Helen Davis,Helen
x,4,5,6,7,20,5,Tall,Heavy,Grace Brown,Grace
c,7,8,9,0,56,5,Short,Middle,Alice Johnson,Alice
d,1,1,2,5,1,3,Tall,Middle,David Miller,David
e,0,0,9,6,0,3,Tall,Middle,Bob Davis,Bob
f,0,0,10,3,0,3,Short,Middle,Grace Brown,Grace
w,1,2,3,4,2,3,Average,Middle,Alice Garcia,Alice

### Swapping columns

In [3562]:
cols = list(df.columns)
i, j = cols.index("A"), cols.index("C")
cols[i], cols[j] = cols[j], cols[i]
df = df[cols]
df

,C,B,A,D,new,price,some_category,one more category,Name,First Name
a,3,2,1,4,2,3,Average,Middle,Helen Davis,Helen
x,6,5,4,7,20,5,Tall,Heavy,Grace Brown,Grace
c,9,8,7,0,56,5,Short,Middle,Alice Johnson,Alice
d,2,1,1,5,1,3,Tall,Middle,David Miller,David
e,9,0,0,6,0,3,Tall,Middle,Bob Davis,Bob
f,10,0,0,3,0,3,Short,Middle,Grace Brown,Grace
w,3,2,1,4,2,3,Average,Middle,Alice Garcia,Alice

### Swapping rows

In [3563]:
rows = list(df.index)
i, j = rows.index("a"), rows.index("e")
rows[i], rows[j] = rows[j], rows[i]
df = df.loc[rows]

df

,C,B,A,D,new,price,some_category,one more category,Name,First Name
e,9,0,0,6,0,3,Tall,Middle,Bob Davis,Bob
x,6,5,4,7,20,5,Tall,Heavy,Grace Brown,Grace
c,9,8,7,0,56,5,Short,Middle,Alice Johnson,Alice
d,2,1,1,5,1,3,Tall,Middle,David Miller,David
a,3,2,1,4,2,3,Average,Middle,Helen Davis,Helen
f,10,0,0,3,0,3,Short,Middle,Grace Brown,Grace
w,3,2,1,4,2,3,Average,Middle,Alice Garcia,Alice

## Filtering rows

In [3564]:
df

,C,B,A,D,new,price,some_category,one more category,Name,First Name
e,9,0,0,6,0,3,Tall,Middle,Bob Davis,Bob
x,6,5,4,7,20,5,Tall,Heavy,Grace Brown,Grace
c,9,8,7,0,56,5,Short,Middle,Alice Johnson,Alice
d,2,1,1,5,1,3,Tall,Middle,David Miller,David
a,3,2,1,4,2,3,Average,Middle,Helen Davis,Helen
f,10,0,0,3,0,3,Short,Middle,Grace Brown,Grace
w,3,2,1,4,2,3,Average,Middle,Alice Garcia,Alice

### Filtering with condition(s)

In [3565]:
df

,C,B,A,D,new,price,some_category,one more category,Name,First Name
e,9,0,0,6,0,3,Tall,Middle,Bob Davis,Bob
x,6,5,4,7,20,5,Tall,Heavy,Grace Brown,Grace
c,9,8,7,0,56,5,Short,Middle,Alice Johnson,Alice
d,2,1,1,5,1,3,Tall,Middle,David Miller,David
a,3,2,1,4,2,3,Average,Middle,Helen Davis,Helen
f,10,0,0,3,0,3,Short,Middle,Grace Brown,Grace
w,3,2,1,4,2,3,Average,Middle,Alice Garcia,Alice

In [3566]:
# df["A"] > 1
# df.loc[df["A"] > 1]
# df.loc[df["A"] > 1, ["A","Name",'new']]
df.loc[df.loc[:,"A"] > 1, ["A","Name",'new']]
df[df["A"] > 1] # Without .loc

,C,B,A,D,new,price,some_category,one more category,Name,First Name
x,6,5,4,7,20,5,Tall,Heavy,Grace Brown,Grace
c,9,8,7,0,56,5,Short,Middle,Alice Johnson,Alice

In [3567]:
df.loc[df["A"] > 1, ["C","A", "one more category"]]
df[df["A"] > 1][["C","A","one more category"]] # Without .loc

   C  A one more category
x  6  4             Heavy
c  9  7            Middle

In [3568]:
df[(df['A'] < 3) | (df['B'] == 0)]

,C,B,A,D,new,price,some_category,one more category,Name,First Name
e,9,0,0,6,0,3,Tall,Middle,Bob Davis,Bob
d,2,1,1,5,1,3,Tall,Middle,David Miller,David
a,3,2,1,4,2,3,Average,Middle,Helen Davis,Helen
f,10,0,0,3,0,3,Short,Middle,Grace Brown,Grace
w,3,2,1,4,2,3,Average,Middle,Alice Garcia,Alice

### Filtering `nan`'s

In [3569]:
# Let's have some NaN values in our dataframe

# Number of random NaNs to introduce
num_nans = 5  
row_indices = np.random.choice(df.index, size=num_nans)
col_indices = np.random.choice(df.columns, size=1)
df.loc[row_indices, col_indices] = np.nan
df

c:\Users\kuzmi\AppData\Local\Programs\Python\Python312\Lib\site-packages\IPython\core\displayhook.py:281: UserWarning: Output cache limit (currently 1000 entries) hit.
Flushing oldest 200 entries.
  warn('Output cache limit (currently {sz} entries) hit.\n'

,C,B,A,D,new,price,some_category,one more category,Name,First Name
e,9,0,0,6.0,0,3,Tall,Middle,Bob Davis,Bob
x,6,5,4,NaN,20,5,Tall,Heavy,Grace Brown,Grace
c,9,8,7,NaN,56,5,Short,Middle,Alice Johnson,Alice
d,2,1,1,5.0,1,3,Tall,Middle,David Miller,David
a,3,2,1,4.0,2,3,Average,Middle,Helen Davis,Helen
f,10,0,0,NaN,0,3,Short,Middle,Grace Brown,Grace
w,3,2,1,NaN,2,3,Average,Middle,Alice Garcia,Alice

In [3570]:
df[df['price'].notna()]

,C,B,A,D,new,price,some_category,one more category,Name,First Name
e,9,0,0,6.0,0,3,Tall,Middle,Bob Davis,Bob
x,6,5,4,NaN,20,5,Tall,Heavy,Grace Brown,Grace
c,9,8,7,NaN,56,5,Short,Middle,Alice Johnson,Alice
d,2,1,1,5.0,1,3,Tall,Middle,David Miller,David
a,3,2,1,4.0,2,3,Average,Middle,Helen Davis,Helen
f,10,0,0,NaN,0,3,Short,Middle,Grace Brown,Grace
w,3,2,1,NaN,2,3,Average,Middle,Alice Garcia,Alice

In [3571]:
# Keep only rows that have any missing values
df[df.isna().any(axis=1)]
df.loc[df.isna().any(axis=1), :]

,C,B,A,D,new,price,some_category,one more category,Name,First Name
x,6,5,4,NaN,20,5,Tall,Heavy,Grace Brown,Grace
c,9,8,7,NaN,56,5,Short,Middle,Alice Johnson,Alice
f,10,0,0,NaN,0,3,Short,Middle,Grace Brown,Grace
w,3,2,1,NaN,2,3,Average,Middle,Alice Garcia,Alice

In [3572]:
# Keep only columns that have any missing values
df.loc[:, df.isna().any(axis=0)]
df.loc[:, df.isna().any()]

     D
e  6.0
x  NaN
c  NaN
d  5.0
a  4.0
f  NaN
w  NaN

In [3573]:
# Keep only rows that have no missing values
df[df.notna().all(axis=1)]
df.loc[df.notna().all(axis=1)]

,C,B,A,D,new,price,some_category,one more category,Name,First Name
e,9,0,0,6.0,0,3,Tall,Middle,Bob Davis,Bob
d,2,1,1,5.0,1,3,Tall,Middle,David Miller,David
a,3,2,1,4.0,2,3,Average,Middle,Helen Davis,Helen

In [3574]:
# Keep only columns that have no missing values
df.loc[:,df.notna().all(axis=0)]

,C,B,A,new,price,some_category,one more category,Name,First Name
e,9,0,0,0,3,Tall,Middle,Bob Davis,Bob
x,6,5,4,20,5,Tall,Heavy,Grace Brown,Grace
c,9,8,7,56,5,Short,Middle,Alice Johnson,Alice
d,2,1,1,1,3,Tall,Middle,David Miller,David
a,3,2,1,2,3,Average,Middle,Helen Davis,Helen
f,10,0,0,0,3,Short,Middle,Grace Brown,Grace
w,3,2,1,2,3,Average,Middle,Alice Garcia,Alice

### String filtering

In [3575]:
df[df['some_category'].str.contains("tall", case=False)]

,C,B,A,D,new,price,some_category,one more category,Name,First Name
e,9,0,0,6.0,0,3,Tall,Middle,Bob Davis,Bob
x,6,5,4,NaN,20,5,Tall,Heavy,Grace Brown,Grace
d,2,1,1,5.0,1,3,Tall,Middle,David Miller,David

In [3576]:
# Regex syntax!
df[df['some_category'].str.contains('tall|short', case=False)]

,C,B,A,D,new,price,some_category,one more category,Name,First Name
e,9,0,0,6.0,0,3,Tall,Middle,Bob Davis,Bob
x,6,5,4,NaN,20,5,Tall,Heavy,Grace Brown,Grace
c,9,8,7,NaN,56,5,Short,Middle,Alice Johnson,Alice
d,2,1,1,5.0,1,3,Tall,Middle,David Miller,David
f,10,0,0,NaN,0,3,Short,Middle,Grace Brown,Grace

In [3577]:
df

,C,B,A,D,new,price,some_category,one more category,Name,First Name
e,9,0,0,6.0,0,3,Tall,Middle,Bob Davis,Bob
x,6,5,4,NaN,20,5,Tall,Heavy,Grace Brown,Grace
c,9,8,7,NaN,56,5,Short,Middle,Alice Johnson,Alice
d,2,1,1,5.0,1,3,Tall,Middle,David Miller,David
a,3,2,1,4.0,2,3,Average,Middle,Helen Davis,Helen
f,10,0,0,NaN,0,3,Short,Middle,Grace Brown,Grace
w,3,2,1,NaN,2,3,Average,Middle,Alice Garcia,Alice

In [3578]:
df[df['A'].isin([2,3,5,7]) & (df['some_category'].str.lower().str.startswith("sh"))]

,C,B,A,D,new,price,some_category,one more category,Name,First Name
c,9,8,7,NaN,56,5,Short,Middle,Alice Johnson,Alice

## Filtering columns

In [3579]:
df

,C,B,A,D,new,price,some_category,one more category,Name,First Name
e,9,0,0,6.0,0,3,Tall,Middle,Bob Davis,Bob
x,6,5,4,NaN,20,5,Tall,Heavy,Grace Brown,Grace
c,9,8,7,NaN,56,5,Short,Middle,Alice Johnson,Alice
d,2,1,1,5.0,1,3,Tall,Middle,David Miller,David
a,3,2,1,4.0,2,3,Average,Middle,Helen Davis,Helen
f,10,0,0,NaN,0,3,Short,Middle,Grace Brown,Grace
w,3,2,1,NaN,2,3,Average,Middle,Alice Garcia,Alice

### Selecting specific columns

In [3580]:
df[['A', 'Name']]

   A           Name
e  0      Bob Davis
x  4    Grace Brown
c  7  Alice Johnson
d  1   David Miller
a  1    Helen Davis
f  0    Grace Brown
w  1   Alice Garcia

### Based on data type

In [3581]:
df.select_dtypes(include=['number'])

    C  B  A    D  new  price
e   9  0  0  6.0    0      3
x   6  5  4  NaN   20      5
c   9  8  7  NaN   56      5
d   2  1  1  5.0    1      3
a   3  2  1  4.0    2      3
f  10  0  0  NaN    0      3
w   3  2  1  NaN    2      3

### By name pattern

In [3582]:
df.filter(items=['A', 'C']) # selects columns A and C

   A   C
e  0   9
x  4   6
c  7   9
d  1   2
a  1   3
f  0  10
w  1   3

In [3583]:
df.filter(items=['a', 'd', 'c'], axis=0)   # select rows with index a, d, and c

,C,B,A,D,new,price,some_category,one more category,Name,First Name
a,3,2,1,4.0,2,3,Average,Middle,Helen Davis,Helen
d,2,1,1,5.0,1,3,Tall,Middle,David Miller,David
c,9,8,7,NaN,56,5,Short,Middle,Alice Johnson,Alice

In [3584]:
df.filter(like='Name')   # selects all columns containing 'Name'

            Name First Name
e      Bob Davis        Bob
x    Grace Brown      Grace
c  Alice Johnson      Alice
d   David Miller      David
a    Helen Davis      Helen
f    Grace Brown      Grace
w   Alice Garcia      Alice

In [3585]:
df.filter(regex='^A|^N', axis=1)   # all columns starting with 'A' or 'N'

   A           Name
e  0      Bob Davis
x  4    Grace Brown
c  7  Alice Johnson
d  1   David Miller
a  1    Helen Davis
f  0    Grace Brown
w  1   Alice Garcia

## Handling Null Values

In [3586]:
# Let's add some NaN values in our dataframe

rng = np.random.default_rng(1)

n_rows, n_cols = df.shape
n_cells = df.size

flat_idx = rng.choice(n_cells, size=5, replace=False)
mask = np.zeros((n_rows, n_cols), dtype=bool)
mask[np.unravel_index(flat_idx, (n_rows, n_cols))] = True
mask_df = pd.DataFrame(mask, index=df.index, columns=df.columns)
df = df.mask(mask_df)
df

,C,B,A,D,new,price,some_category,one more category,Name,First Name
e,9,0.0,NaN,6.0,0.0,3.0,Tall,Middle,Bob Davis,Bob
x,6,5.0,4.0,NaN,20.0,5.0,Tall,Heavy,Grace Brown,Grace
c,9,8.0,7.0,NaN,56.0,5.0,Short,Middle,Alice Johnson,Alice
d,2,NaN,1.0,5.0,NaN,3.0,Tall,Middle,David Miller,David
a,3,2.0,1.0,4.0,2.0,3.0,Average,Middle,Helen Davis,Helen
f,10,NaN,0.0,NaN,0.0,3.0,Short,Middle,Grace Brown,Grace
w,3,2.0,1.0,NaN,2.0,NaN,Average,Middle,Alice Garcia,Alice

### Dropping Nulls
- `df.dropna()`   drop any row with a missing value.  
- `df.dropna(axis=1)`   drop columns with missing values.  
- Options:  
  - `how="all"`   drop only if *all* values are missing.  
  - `subset=["col1","col2"]`   check only certain columns.

In [3587]:
df

,C,B,A,D,new,price,some_category,one more category,Name,First Name
e,9,0.0,NaN,6.0,0.0,3.0,Tall,Middle,Bob Davis,Bob
x,6,5.0,4.0,NaN,20.0,5.0,Tall,Heavy,Grace Brown,Grace
c,9,8.0,7.0,NaN,56.0,5.0,Short,Middle,Alice Johnson,Alice
d,2,NaN,1.0,5.0,NaN,3.0,Tall,Middle,David Miller,David
a,3,2.0,1.0,4.0,2.0,3.0,Average,Middle,Helen Davis,Helen
f,10,NaN,0.0,NaN,0.0,3.0,Short,Middle,Grace Brown,Grace
w,3,2.0,1.0,NaN,2.0,NaN,Average,Middle,Alice Garcia,Alice

In [3588]:
df.dropna(axis=0, how='any')

,C,B,A,D,new,price,some_category,one more category,Name,First Name
a,3,2.0,1.0,4.0,2.0,3.0,Average,Middle,Helen Davis,Helen

In [3589]:
df.dropna(subset=['C', 'price'])

,C,B,A,D,new,price,some_category,one more category,Name,First Name
e,9,0.0,NaN,6.0,0.0,3.0,Tall,Middle,Bob Davis,Bob
x,6,5.0,4.0,NaN,20.0,5.0,Tall,Heavy,Grace Brown,Grace
c,9,8.0,7.0,NaN,56.0,5.0,Short,Middle,Alice Johnson,Alice
d,2,NaN,1.0,5.0,NaN,3.0,Tall,Middle,David Miller,David
a,3,2.0,1.0,4.0,2.0,3.0,Average,Middle,Helen Davis,Helen
f,10,NaN,0.0,NaN,0.0,3.0,Short,Middle,Grace Brown,Grace

### Filling Nulls
- `df.fillna(value)`  replace NaNs with a given value.  

- Can be done column-specific:  
  `df["col"].fillna(df["col"].mean())`

  `df["col"].ffill()` forward fill (use previous value).
    
  `df["col"].bfill()` backward fill (use next value).

In [3590]:
df

,C,B,A,D,new,price,some_category,one more category,Name,First Name
e,9,0.0,NaN,6.0,0.0,3.0,Tall,Middle,Bob Davis,Bob
x,6,5.0,4.0,NaN,20.0,5.0,Tall,Heavy,Grace Brown,Grace
c,9,8.0,7.0,NaN,56.0,5.0,Short,Middle,Alice Johnson,Alice
d,2,NaN,1.0,5.0,NaN,3.0,Tall,Middle,David Miller,David
a,3,2.0,1.0,4.0,2.0,3.0,Average,Middle,Helen Davis,Helen
f,10,NaN,0.0,NaN,0.0,3.0,Short,Middle,Grace Brown,Grace
w,3,2.0,1.0,NaN,2.0,NaN,Average,Middle,Alice Garcia,Alice

In [3591]:
df.loc[:, 'B'] = df['B'].ffill()
df

,C,B,A,D,new,price,some_category,one more category,Name,First Name
e,9,0.0,NaN,6.0,0.0,3.0,Tall,Middle,Bob Davis,Bob
x,6,5.0,4.0,NaN,20.0,5.0,Tall,Heavy,Grace Brown,Grace
c,9,8.0,7.0,NaN,56.0,5.0,Short,Middle,Alice Johnson,Alice
d,2,8.0,1.0,5.0,NaN,3.0,Tall,Middle,David Miller,David
a,3,2.0,1.0,4.0,2.0,3.0,Average,Middle,Helen Davis,Helen
f,10,2.0,0.0,NaN,0.0,3.0,Short,Middle,Grace Brown,Grace
w,3,2.0,1.0,NaN,2.0,NaN,Average,Middle,Alice Garcia,Alice

In [3592]:
df.loc[:, 'C'] = df['C'].fillna(df['C'].mean())
df

,C,B,A,D,new,price,some_category,one more category,Name,First Name
e,9,0.0,NaN,6.0,0.0,3.0,Tall,Middle,Bob Davis,Bob
x,6,5.0,4.0,NaN,20.0,5.0,Tall,Heavy,Grace Brown,Grace
c,9,8.0,7.0,NaN,56.0,5.0,Short,Middle,Alice Johnson,Alice
d,2,8.0,1.0,5.0,NaN,3.0,Tall,Middle,David Miller,David
a,3,2.0,1.0,4.0,2.0,3.0,Average,Middle,Helen Davis,Helen
f,10,2.0,0.0,NaN,0.0,3.0,Short,Middle,Grace Brown,Grace
w,3,2.0,1.0,NaN,2.0,NaN,Average,Middle,Alice Garcia,Alice

### Interpolating
- `df.interpolate()`  fill missing values by interpolation.

In [3593]:
df

,C,B,A,D,new,price,some_category,one more category,Name,First Name
e,9,0.0,NaN,6.0,0.0,3.0,Tall,Middle,Bob Davis,Bob
x,6,5.0,4.0,NaN,20.0,5.0,Tall,Heavy,Grace Brown,Grace
c,9,8.0,7.0,NaN,56.0,5.0,Short,Middle,Alice Johnson,Alice
d,2,8.0,1.0,5.0,NaN,3.0,Tall,Middle,David Miller,David
a,3,2.0,1.0,4.0,2.0,3.0,Average,Middle,Helen Davis,Helen
f,10,2.0,0.0,NaN,0.0,3.0,Short,Middle,Grace Brown,Grace
w,3,2.0,1.0,NaN,2.0,NaN,Average,Middle,Alice Garcia,Alice

In [3594]:
tmp_df = df.reset_index(drop=True)

tmp_df.loc[:, 'new'] = tmp_df['new'].interpolate(method='cubic')
tmp_df

,C,B,A,D,new,price,some_category,one more category,Name,First Name
0,9,0.0,NaN,6.0,0.00,3.0,Tall,Middle,Bob Davis,Bob
1,6,5.0,4.0,NaN,20.00,5.0,Tall,Heavy,Grace Brown,Grace
2,9,8.0,7.0,NaN,56.00,5.0,Short,Middle,Alice Johnson,Alice
3,2,8.0,1.0,5.0,36.75,3.0,Tall,Middle,David Miller,David
4,3,2.0,1.0,4.0,2.00,3.0,Average,Middle,Helen Davis,Helen
5,10,2.0,0.0,NaN,0.00,3.0,Short,Middle,Grace Brown,Grace
6,3,2.0,1.0,NaN,2.00,NaN,Average,Middle,Alice Garcia,Alice

### Replacing
- `df.replace(to_replace=np.nan, value="Unknown")`  replace NaN with custom text/values.

In [3595]:
df.replace(to_replace=np.nan, value="Unknown")

,C,B,A,D,new,price,some_category,one more category,Name,First Name
e,9,0.0,Unknown,6.0,0.0,3.0,Tall,Middle,Bob Davis,Bob
x,6,5.0,4.0,Unknown,20.0,5.0,Tall,Heavy,Grace Brown,Grace
c,9,8.0,7.0,Unknown,56.0,5.0,Short,Middle,Alice Johnson,Alice
d,2,8.0,1.0,5.0,Unknown,3.0,Tall,Middle,David Miller,David
a,3,2.0,1.0,4.0,2.0,3.0,Average,Middle,Helen Davis,Helen
f,10,2.0,0.0,Unknown,0.0,3.0,Short,Middle,Grace Brown,Grace
w,3,2.0,1.0,Unknown,2.0,Unknown,Average,Middle,Alice Garcia,Alice

## Grouping data

`.groupby('some_category')` groups all rows having the same attributes (as specified in by parameter) into separate data frames.

After the groupby, you need an aggregate function to summarize data in each subframe.

You may do it in 2 ways:

In [3596]:
df

,C,B,A,D,new,price,some_category,one more category,Name,First Name
e,9,0.0,NaN,6.0,0.0,3.0,Tall,Middle,Bob Davis,Bob
x,6,5.0,4.0,NaN,20.0,5.0,Tall,Heavy,Grace Brown,Grace
c,9,8.0,7.0,NaN,56.0,5.0,Short,Middle,Alice Johnson,Alice
d,2,8.0,1.0,5.0,NaN,3.0,Tall,Middle,David Miller,David
a,3,2.0,1.0,4.0,2.0,3.0,Average,Middle,Helen Davis,Helen
f,10,2.0,0.0,NaN,0.0,3.0,Short,Middle,Grace Brown,Grace
w,3,2.0,1.0,NaN,2.0,NaN,Average,Middle,Alice Garcia,Alice

In [3597]:
# In each subframe, take the `price` column and summarize it
# using the `sum` function from the result
df.groupby(['some_category'])['price'].sum()

some_category
Average     3.0
Short       8.0
Tall       11.0
Name: price, dtype: float64

In [3598]:
# In each subframe, apply the `sum` function to all numeric
# columns then extract the `price` column
df.groupby(['some_category']).sum()['price']

some_category
Average     3.0
Short       8.0
Tall       11.0
Name: price, dtype: float64

In [3599]:
df.groupby("some_category").agg({
    "new": "sum",
    "price": "median"
})

                new  price
some_category
Average         4.0    3.0
Short          56.0    4.0
Tall           20.0    3.0

## Pivot Tables

Pivot tables allow you to summarize data by reorganizing it into a table where:
- Rows represent one set of keys,
- Columns represent another set of keys,
- Cell values are an aggregated function (like sum, mean, count, etc.).



### Creating a Pivot Table

Use `pd.pivot_table()`:

```python
pd.pivot_table(
    data=df,
    values="column_to_aggregate",
    index="column_for_rows",
    columns="column_for_columns",
    aggfunc="function"
)

In [3600]:
df

,C,B,A,D,new,price,some_category,one more category,Name,First Name
e,9,0.0,NaN,6.0,0.0,3.0,Tall,Middle,Bob Davis,Bob
x,6,5.0,4.0,NaN,20.0,5.0,Tall,Heavy,Grace Brown,Grace
c,9,8.0,7.0,NaN,56.0,5.0,Short,Middle,Alice Johnson,Alice
d,2,8.0,1.0,5.0,NaN,3.0,Tall,Middle,David Miller,David
a,3,2.0,1.0,4.0,2.0,3.0,Average,Middle,Helen Davis,Helen
f,10,2.0,0.0,NaN,0.0,3.0,Short,Middle,Grace Brown,Grace
w,3,2.0,1.0,NaN,2.0,NaN,Average,Middle,Alice Garcia,Alice

In [3601]:
df.pivot_table(index='some_category', columns='one more category',values='price')

one more category  Heavy  Middle
some_category
Average              NaN     3.0
Short                NaN     4.0
Tall                 5.0     3.0

In [3602]:
df.pivot_table(index='some_category', columns='one more category', values='price', aggfunc='sum')

one more category  Heavy  Middle
some_category
Average              NaN     3.0
Short                NaN     8.0
Tall                 5.0     6.0

In [3603]:
df.pivot_table(index='some_category', columns='one more category', values='price', aggfunc=['sum', 'mean'])

                    sum         mean
one more category Heavy Middle Heavy Middle
some_category
Average             NaN    3.0   NaN    3.0
Short               NaN    8.0   NaN    4.0
Tall                5.0    6.0   5.0    3.0